Repository: natcap/opal
Catalog: i18n/*.po
Languages: es

source: Road/Paved
es: Carretera/Pavimentado

source: Mine/Bare
es: Mina/Desnudo

source: Report
es: Reporte

source: Per-Zone Analyses
es: Por zona de análisis

source: Select a zone to navigate to its impact summary.
es: Seleccione una zona para navegar a su resumen de impacto.

source: Impact footprint shapefile
es: Área de impacto del proyecto

source: Ecosystem type
es: Ecosistema

source: Total impacted area (ha)
es: Área total impactada (Ha)

source: Required offset area (ha)
es: Área de compensación requerida (Ha)

source: Mean mitigation ratio
es: Tasa de mitigación promedio

source: No. patches impacted
es: Número de parches impactados

source: Area offset (ha)
es: Área compensada (Ha)

source: Net benefits (ha)
es: Beneficios netos (Ha)

source: <b>NOTE:</b> Impact and offset values are <b>unitless</b> unless you have calibrated your static map model runs.
es: <b>NOTA:</b> Los valores <b>no tienen unidades</b> menos que se calibran los mapas estáticos.

source: Summary of impacts to ecosystems and ecosystem services
es: Resumen de impactos a los ecosistemas y servicios ecosistémicos

source: Impact type
es: Tipo de impacto

source: Total impacts to ecosystem services
es: Impacto total a los servicios ecosistémicos

source: Total impacts to terrestrial ecosystems
es: Impacto total a los ecosistemas terrestres

source: Details of impacts to terrestrial ecosystems
es: Detalle de los impactos a ecosistemas terrestres

source: Offset patches and mitigation potential
es: Parches de compensación y potencial de mitigación

source: Possible offset patches
es: Parches posibles de compensación

source: GIS vector with all selected offset patches
es: Archivo SIG con los parches compensados seleccionados

source: Suggested offset parcels
es: Parcelas de compensación sugeridas

source: Suggested parcels account for %sx impacts x mitigation ratio
es: Parcelas sugeridos representan %sx impactos x la tasa de mitigación

source: Net benefits to ecosystems and ecosystem services
es: Beneficios netos a los ecosistemas y a los servicios ecosistémicos

source: Benefits to terrestrial ecosystems
es: Beneficios a los ecosistemas terrestres

source: Ecosystem service benefits
es: Beneficio en servicios ecosistémicos

source: WARNING: Impact sites intersect an avoidance area
es: ATENCIÓN: Los sitios de impacto se intersectan con un área a evitar

source: Sediment
es: Sedimentos

source: Nitrogen
es: Impacto de nitrógeno

source: Carbon
es: Carbono

source: Custom
es: Otro servico

source: Features provided must be polygons, but found %s instead
es: Formas deben ser polígonos, no %s

source: Potential offset patch ID code
es: Id del parche potencial de compensación

source: Sediment retention offset
es: Compensación de retención de sedimentos

source: Nitrogen retention offset
es: Compensación de retención de nitrógeno

source: Carbon storage offset
es: Compensación de acumulación de carbono

source: Percent of total impact offset (sediment)
es: Porcentaje de la compensación total del impacto (sedimentos)

source: Percent of total impact offset (nitrogen)
es: Porcentaje de la compensación total del impacto (Nitrógeno)

source: Percent of total impact offset (carbon)
es: Porcentaje de la compensación total del impacto (carbono)

source: Distance from impact site (km)
es: Distancia del sitio de impacto (Km)

source: Total patch area (ha)
es: Área total de parche (Ha)

source: Custom ecosystem service offset
es: Compensación del servicio ecosistémico propio

source: Percent of total impact offset (custom ES)
es: Porcentaje de la compensación total del impacto (SE propio)

source: Landscape context index (LCI)
es: Índice de contexto paisajístico (LCI)

source: Suggested offset parcel
es: Parcelas de compensación sugeridas

source: Soft Boundary 3
es: Límite suave 3

source: Avoidance Areas
es: Áreas a evitar

source: Conservation Portfolio
es: Portafolio de conservación

source: Richness
es: Riqueza

source: Threat
es: Amenaza

source: Soft Boundary 2
es: Límite suave 2

source: Soft Boundary 1
es: Límite suave 1

source: Hydrographic sub-zone
es: Subzona hidrográfica

source: AOI (area of influence)
es: AOI (Área de Infuencia)

source: Municipality
es: Municipio

source: Impacted patch code
es: Código del parche impactado

source: Mitigation ratio
es: Tasa de mitigación

source: Landscape Context Index (LCI)
es: Índice de contexto paisajístico (LCI)

source: Patch area impacted (ha)
es: Área del parche impactada

source: Population center
es: Centro poblado

source: Population size
es: Tamaño de población

source: Sediment impact
es: Impacto de sedimentos

source: Nitrogen impact
es: Impacto de nitrógeno

source: Custom impact
es: Impacto propio

source: Sediment offset
es: Compensación de sedimentos

source: Nitrogen offset
es: Compensación de nitrógeno

source: Custom offset
es: Compensación propia

source: Net sediment retention benefits
es: Beneficios netos de la retención de sedimentos

source: Net nitrogen retention benefits
es: Beneficios netos de la retención de nitrógeno

source: Net custom ES benefits
es: Beneficios netos del SE propio

source: Net sediment x population
es: Sedimentos netos * población

source: Net nitrogen x population
es: Nitrógeno neto * población

source: Net custom ES x population
es: SE propio neto * población

source: Carbon impact
es: Impacto de carbono

source: Service type
es: Tipo de servicio

source: Impacts to service
es: Impactos al servicio

source: Selected offset
es: Compensación seleccionada

source: Net service
es: Servicio neto

source: Service name
es: Tipo de servicio

source: Impact to service
es: Impactos al servicio

source: Required offset value
es: Área de compensación requerida (Ha)

source: Nutrient
es: Nutrientes

source: Custom ecosystem service
es: Otros servicos ecosistemicos
